import React from 'react';
import briefcase from "../../img/icons/briefcase.svg"
import list from "../../img/icons/list.svg"
import bag from "../../img/icons/bag.svg"

const Service = ({selectedService}) => {

    return (
        <div className="service-info">
            {selectedService === 'landing' && (
                <div>
                    <h3>Ідеальний варіант для бізнесу, якому потрібна коротка, але змістовна, презентація</h3>
                    <p>Завдяки зручності такого формату, можна легко подати користувачу всю важливу інформацію та швидко
                        підвести його до покупки</p>
                    <p>Обирайте цей тип сайту, якщо:</p>
                    <ul>
                        <li>
                            <img src={list} height="28" width="28" loading="lazy" alt=""/>
                            <p>Ви хочете презентувати власний інфо-продукт, послугу, книгу і т.д.</p>
                        </li>
                        <li><img src={bag} height="28" width="28" loading="lazy" alt=""/>
                            <p>У вас невелика кількість продуктів (до 8)</p></li>
                        <li><img src={briefcase} height="28" width="28" loading="lazy" alt=""/>
                            <p>Вам потрібне коротке портфоліо спеціаліста або сайт-візитка</p></li>
                    </ul>
                </div>
            )}
            {selectedService === 'corporat' && (
                <div>
                    <h3>Величезне поле для креативу</h3>
                    <p>Ви можете використати будь-яку кількість сторінок для того, щоб розповісти про свій бізнес,
                        показати свій продукт, презентувати компанію або просто поділитись корисною інформацією</p>
                    <p>Обирайте цей тип сайту, якщо:</p>
                    <ul>
                        <li>
                            <img src={list} height="28" width="28" loading="lazy" alt=""/>
                            <p>Вам потрібно більше однієї сторінки на сайті</p>
                        </li>
                        <li><img src={bag} height="28" width="28" loading="lazy" alt=""/>
                            <p>Ви плануєте зробити блог та/або особистий кабінет</p></li>
                        <li><img src={briefcase} height="28" width="28" loading="lazy" alt=""/>
                            <p>На сайті передбачається будь-який інший додатковий функціонал</p></li>
                    </ul>
                </div>
            )}
            {selectedService === 'shop' && (
                <div>
                    <h3>Зручний сайт для бізнесу, який дозволить користувачам:</h3>
                    <p>Каталог, зручна фільтрація, особистий кабінет і продуманий до деталей інтерфейс точно збільшать
                        кількість ваших клієнтів завдяки комфортному користуванню та легкому оформленню покупки</p>
                    <p>Обирайте цей тип сайту, якщо:</p>
                    <ul>
                        <li>
                            <img src={list} height="28" width="28" loading="lazy" alt=""/>
                            <p>Вам потрібен каталог, корзина, особистий кабінет або інші сторінки такого типу</p>
                        </li>
                        <li><img src={bag} height="28" width="28" loading="lazy" alt=""/>
                            <p>У вас більше 8 товарів</p></li>
                        <li><img src={briefcase} height="28" width="28" loading="lazy" alt=""/>
                            <p>Швидко знайти потрібний товар</p></li>
                    </ul>
                </div>
            )}
            {selectedService === 'audit' && (
                <div>
                    <h3>Детальний аудит вашого сайту по всім можливим параметрам</h3>
                    <p>В аудиті розглядаються: дизайн, текст, конверсія, технічні данні, індексація пошуковими системами та багато інших характеристик</p>
                    <p>Аудит допоможе вам:</p>
                    <ul>
                        <li>
                            <img src={list} height="28" width="28" loading="lazy" alt=""/>
                            <p>Побачити зроблені помилки</p>
                        </li>
                        <li><img src={bag} height="28" width="28" loading="lazy" alt=""/>
                            <p>Знайти правильний підхід до своїх клієнтів</p></li>
                        <li><img src={briefcase} height="28" width="28" loading="lazy" alt=""/>
                            <p>В рази збільшити показник конверсії</p></li>
                    </ul>
                </div>
            )}
            {selectedService === 'consultation' && (
                <div>
                    <h3>Ідеальний початок для просування вашого бізнесу в інтернеті</h3>
                    <p>Окрім готового фундаменту для власного сайту, ви отримаєте рекомендації, які допоможуть вам швидко досягнути успіху в просуванні свого бізнесу</p>
                    <ul>
                        <li>
                            <img src={list} height="28" width="28"  loading="lazy" alt=""/>
                            <p>Консультація триває 1.5 години в онлайн форматі</p>
                        </li>
                        <li><img src={bag} height="28" width="28" loading="lazy" alt=""/>
                            <p>Ви можете вказати додаткові запитання щодо вашого бізнесу та, за попереднім узгодженням, я включу їх в нашу консультацію</p></li>
                    </ul>
                </div>
            )}
        </div>
    );
};

export default Service;
